#### Load college dataset into BQ
##### Refer to https://cloud.google.com/bigquery/docs/reference/bq-cli-reference#top_of_page for documentation on bq tool and bq load command

In [1]:
dataset_id = "college"

In [3]:
!bq --location=US mk --dataset {dataset_id}

Dataset 'lone-ranger:college' successfully created.

In [4]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Class 'gs://cs327e-open-access/college_normalized/class.csv'

Waiting on bqjob_r209e0245092f49ad_000001757fbdbf57_1 ... (2s) Current status: DONE

In [5]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Student 'gs://cs327e-open-access/college_normalized/student.csv'

Waiting on bqjob_r28ec28b743bca532_000001757fbdde6f_1 ... (1s) Current status: DONE

In [6]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Teacher 'gs://cs327e-open-access/college_normalized/teacher.csv'

Waiting on bqjob_r3aa707552a0dd90_000001757fbdec67_1 ... (1s) Current status: DONE

In [7]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Takes 'gs://cs327e-open-access/college_normalized/takes.csv'

Waiting on bqjob_r366b8704e55176d9_000001757fbdfa37_1 ... (1s) Current status: DONE

In [8]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Teaches 'gs://cs327e-open-access/college_normalized/teaches.csv'

Waiting on bqjob_r12503900d4b3a4e2_000001757fbe0832_1 ... (1s) Current status: DONE

#### Suppose that Student had not loaded correctly with the --autodetect option

In [22]:
%%bigquery
drop table

Empty DataFrame
Columns: []
Index: []

In [23]:
!bq --location=US load --skip_leading_rows=1 --allow_jagged_rows=true --source_format=CSV {dataset_id}.Student \
gs://cs327e-open-access/college_normalized/student.csv \
sid:STRING,fname:STRING,lname:STRING,dob:DATE,status:STRING

Waiting on bqjob_r78f3360cb62c31a9_000001757b292bee_1 ... (0s) Current status: DONE

#### Get record count for each table

In [24]:
%%bigquery
select count(*) as count from college.Student

   count
0     12

In [11]:
%%bigquery
select count(*) as count from college.Class

   count
0     10

In [12]:
%%bigquery
select count(*) as count from college.Teacher

   count
0     10

In [13]:
%%bigquery
select count(*) as count from college.Takes

   count
0     10

In [14]:
%%bigquery
select count(*) as count from college.Teaches

   count
0     12

#### Get sample records

In [17]:
%%bigquery
select * from college.Class
limit 5

      cno                        cname  credits
0  CS326E       Elements of Networking        3
1  M328K        Intro to Number Theory        3
2  M362K                 Probability I        3
3  CS347               Data Management        3
4  CS329E  Elements of Web Programming        3

In [25]:
%%bigquery
select * from college.Student
limit 5

        sid    fname     lname         dob status
0     kev18    Kevin       Lin  1999-05-10    CUR
1  sudeepa4  Sudeepa       Roy  2000-10-01    CUR
2    jerryh    Jerry  Hargrove  1999-01-03    CUR
3        jc    James      Cowe  2000-04-22    CUR
4     paulg     Paul      Gore  2000-09-17    CUR

In [19]:
%%bigquery
select * from college.Teacher
limit 5

  string_field_0 string_field_1    string_field_2
0         neeman     Joe Neeman       Mathematics
1           koch      Hans Koch       Mathematics
2        mueller  Peter Mueller       Mathematics
3           tran      Ngoc Tran       Mathematics
4         scohen  Shirley Cohen  Computer Science

In [20]:
%%bigquery
select * from college.Takes
limit 5

  string_field_0 string_field_1 string_field_2
0             jc         CS327E           None
1             jc         CS331E           None
2             jc         CS313E           None
3          kev18         CS329E           None
4          paulg         CS313E           None

In [21]:
%%bigquery
select * from college.Teaches
limit 5

  string_field_0 string_field_1
0           koch         M328K
1           tran         M358K
2          bulko         CS313E
3          fares         CS331E
4          mitra         CS329E